Revit 2026 API

# FabricationPartInsulationSpecification Property

---

The fabrication part insulation specification identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int InsulationSpecification { get; set; }
```
```vb
Public Property InsulationSpecification As Integer
	Get
	Set
```
```cpp
public:
property int InsulationSpecification {
	int get ();
	void set (int value);
}
```
```fsharp
member InsulationSpecification : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: the insulation specification is invalid for the fabrication part. |
| InvalidOperationException | -or- When setting this property: the fabrication part has taps connected. -or- When setting this property: the specification fails to be set by identifier: specId. |

A value of 0 indicates the insulation specification is set to off.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace